Revit 2026 API

# TextNoteLeaderRightAttachment Property

---

Attachment position of leaders on the right side of the text note.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public LeaderAtachement LeaderRightAttachment { get; set; }
```
```vb
Public Property LeaderRightAttachment As LeaderAtachement
	Get
	Set
```
```cpp
public:
property LeaderAtachement LeaderRightAttachment {
	LeaderAtachement get ();
	void set (LeaderAtachement value);
}
```
```fsharp
member LeaderRightAttachment : LeaderAtachement with get, set
```

#### Property Value

LeaderAtachement

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

The property controls the vertical position of leaders attached to the right side of the note.

Change of the value will affect all leaders currently attached to the right side.

#### Reference

TextNote Class

Autodesk.Revit.DB Namespace